{
	"id_salvageAndBuild":"Hey, did you see that?  Some of the robots weren’t destroyed.  Maybe we can salvage them and build more towers.",
	"id_goToEquationScreen":"Go ahead, <click> the button to go see what we salvaged.",
	"id_solveTheClues":"Our engineers say that the robots are rigged to explode if they aren’t disarmed with their 'hidden number'.  I guess we’ll have to solve the clues printed on the robots.",
	"id_selectFirstEquation":"Select one of these clues, or 'equations' to go to the solve screen, where our engineers have a surprise",
		"id_equationSolvingScreen":"This is our equation solving screen, set up with a couple of tools to help us figure out the robots' clues.",
		"id_solveForX":"The engineers have already loaded in the equation.  Now, we need to solve for the mystery number, called 'x'",
		"id_3x4simplifyMultiplicationPrompt":"Since x is already by itself, all we need to do is simplify the right side. Click on the grey circle to simplify the multiplication.",
		
			"id_3x4simplifyScreen1":"This is the Simplify screen. It lets you solve arithmetic problems, like simplifying 4*3. The problem is written at the top of the screen. This one's pretty simple, right?",
			"id_simplifyScreen2":"You can solve the problem by <clicking> on the right solution. If you don't see the number you want, you can pan around by dragging the screen.",
			"id_simplifyScreen3":"For big numbers, you can also type in the answer.",
			"id_simplifyScreen4":"When you're looking for a number, remember that going up or down one row makes the number change by 10, and going right or left one column makes it change by 1. Now, try finding the correct answer.",
			"id_simplifyScreen5":"When you think you've got it, press the Ok button. If you're wrong, the check will turn into an X to let you know. Also, if you ever scroll too far in the wrong direction, press the Center button to get back to where you started.",
			"id_didNotClickGreyCircle":"I see you figured out you can drag some of the blocks and hats.  We don't really need to do that for this problem, because the x was already by itself."		
}